### **Data Mining Using SQL**

<font color="red">File access required:</font> In Colab this notebook requires first uploading files **Shop.csv** and **Movies.csv** using the *Files* feature in the left toolbar. If running the notebook on a local computer, simply ensure these files are in the same workspace as the notebook.

In [1]:
!pip install prettytable==0.7.2
!pip install ipython-sql

Collecting prettytable==0.7.2
  Downloading prettytable-0.7.2.zip (28 kB)
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py) ... done
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13695 sha256=59303837693fc24b10008275f136d837f5de3747d2a21ecf484e99463d7cb7c0
  Stored in directory: /root/.cache/pip/wheels/ca/f9/66/1ebeb8cdff2211eebb6fce02957f9e0a9ae3da4b7e65512d1b
Successfully built prettytable
Installing collected packages: prettytable
  Attempting uninstall: prettytable
    Found existing installation: prettytable 3.17.0
    Uninstalling prettytable-3.17.0:
      Successfully uninstalled prettytable-3.17.0
Successfully installed prettytable-0.7.2
Requirement already satisfied: ipython-sql in /usr/local/lib/python3.12/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (2.0.46)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.5.5)
Requirement already satisfied: six in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.12/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet>=1 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.3.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.12/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.15.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (75.2.0)
Collecting jedi>=0.16 (from ipython->ipython-sql)
  Downloading jedi-0.19.2-py2.py3-none-any.whl.metadata (22 kB)
Requirement already satisfied: decorator in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (3.0.52)
Requirement already satisfied: pygments in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (2.19.2)
Requirement already satisfied: backcall in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (0.2.1)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.12/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.12/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.5)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.12/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.12/dist-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->ipython-sql) (0.5.0)
Downloading jedi-0.19.2-py2.py3-none-any.whl (1.6 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 29.3 MB/s eta 0:00:00
Installing collected packages: jedi
Successfully installed jedi-0.19.2

In [2]:
# Set-up
%load_ext sql
%sql sqlite://
import pandas as pd

In [3]:
# Load tables from CSV files
# Shop
with open('Shop.csv') as f: Shop = pd.read_csv(f, index_col=0)
%sql drop table if exists Shop;
%sql --persist Shop
# Movies
with open('Movies.csv') as f: Movies = pd.read_csv(f, index_col=0)
%sql drop table if exists Movies;
%sql --persist Movies

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted movies'

## Shopping dataset - frequent item-sets

In [4]:
%%sql
select * from Shop

 * sqlite://
Done.

[(1, 'milk'),
 (1, 'eggs'),
 (1, 'juice'),
 (2, 'milk'),
 (2, 'juice'),
 (2, 'cookies'),
 (3, 'eggs'),
 (3, 'chips'),
 (4, 'milk'),
 (4, 'eggs'),
 (5, 'milk'),
 (5, 'juice'),
 (5, 'cookies'),
 (5, 'chips')]

### Frequent item-sets of two

#### All pairs of items occurring together

In [5]:
%%sql
select T1.item as item1, T2.item as item2
from Shop T1, Shop T2
where T1.TID = T2.TID
and T1.item < T2.item

 * sqlite://
Done.

[('eggs', 'milk'),
 ('eggs', 'juice'),
 ('juice', 'milk'),
 ('juice', 'milk'),
 ('cookies', 'milk'),
 ('cookies', 'juice'),
 ('chips', 'eggs'),
 ('eggs', 'milk'),
 ('juice', 'milk'),
 ('cookies', 'milk'),
 ('cookies', 'juice'),
 ('chips', 'milk'),
 ('chips', 'juice'),
 ('chips', 'cookies')]

#### Now with number of transactions they occur together in

In [6]:
%%sql
select T1.item as item1, T2.item as item2, count()
from Shop T1, Shop T2
where T1.TID = T2.TID
and T1.item < T2.item
group by T1.item, T2.item

 * sqlite://
Done.

[('chips', 'cookies', 1),
 ('chips', 'eggs', 1),
 ('chips', 'juice', 1),
 ('chips', 'milk', 1),
 ('cookies', 'juice', 2),
 ('cookies', 'milk', 2),
 ('eggs', 'juice', 1),
 ('eggs', 'milk', 2),
 ('juice', 'milk', 3)]

#### Total number of transactions

In [7]:
%%sql
select count(distinct TID) from Shop

 * sqlite://
Done.

[(5,)]

#### Put it together for frequent item-sets

In [8]:
support = .3
print(support)

0.3

In [9]:
%%sql
select T1.item as item1, T2.item as item2
from Shop T1, Shop T2
where T1.TID = T2.TID
and T1.item < T2.item
group by T1.item, T2.item
having 1.0*count() / (select count(distinct TID) from Shop) > :support

 * sqlite://
Done.

[('cookies', 'juice'),
 ('cookies', 'milk'),
 ('eggs', 'milk'),
 ('juice', 'milk')]

### Frequent item-sets of three

#### All triples of items occurring together

In [10]:
%%sql
select T1.item as item1, T2.item as item2, T3.item as item3
from Shop T1, Shop T2, Shop T3
where T1.TID = T2.TID and T2.TID = T3.TID
and T1.item < T2.item and T2.item < T3.item

 * sqlite://
Done.

[('eggs', 'juice', 'milk'),
 ('cookies', 'juice', 'milk'),
 ('cookies', 'juice', 'milk'),
 ('chips', 'juice', 'milk'),
 ('chips', 'cookies', 'milk'),
 ('chips', 'cookies', 'juice')]

#### Now with number of transactions they occur together in

In [11]:
%%sql
select distinct T1.item as item1, T2.item as item2, T3.item as item3, count()
from Shop T1, Shop T2, Shop T3
where T1.TID = T2.TID and T2.TID = T3.TID
and T1.item < T2.item and T2.item < T3.item
group by T1.item, T2.item, T3.item

 * sqlite://
Done.

[('chips', 'cookies', 'juice', 1),
 ('chips', 'cookies', 'milk', 1),
 ('chips', 'juice', 'milk', 1),
 ('cookies', 'juice', 'milk', 2),
 ('eggs', 'juice', 'milk', 1)]

#### Put it together for frequent item-sets

In [12]:
support = .3
print(support)

0.3

In [13]:
%%sql
select T1.item as item1, T2.item as item2, T3.item as item3
from Shop T1, Shop T2, Shop T3
where T1.TID = T2.TID and T2.TID = T3.TID
and T1.item < T2.item and T2.item < T3.item
group by T1.item, T2.item, T3.item
having 1.0*count() / (select count(distinct TID) from Shop) > :support

 * sqlite://
Done.

[('cookies', 'juice', 'milk')]

### <font color = 'green'>**Your Turn - Movies dataset frequent item-sets**</font>

In [14]:
%%sql
select * from Movies limit 15

 * sqlite://
Done.

[(145755, 'The Fault in Our Stars'),
 (145755, 'Boyhood'),
 (145755, 'Big Hero 6'),
 (145755, 'The Imitation Game'),
 (145755, 'Inside Out'),
 (117070, 'Inside Out'),
 (239040, 'Inside Out'),
 (177796, 'Gone Girl'),
 (177796, 'Magic Mike XXL'),
 (126875, 'The Imitation Game'),
 (126875, 'Inside Out'),
 (55295, 'The Imitation Game'),
 (55295, 'Inside Out'),
 (92094, 'The Fault in Our Stars'),
 (92094, 'Boyhood')]

In [15]:
%%sql
select count(distinct TID) as numUsers,
       count(distinct item) as numMovies
from Movies

 * sqlite://
Done.

[(1382, 123)]

#### Mine for frequent item-sets of three and four items in the Movies dataset. Find a single support threshold where the number of frequent item-sets of three items is more than 10 but less than 20, and the number of frequent item-sets of four items is more than 0.

In [17]:
support = 0.03
print(support)

0.03

In [18]:
%%sql
SELECT T1.item AS item1, T2.item AS item2, T3.item AS item3, COUNT()
FROM Movies T1
JOIN Movies T2, Movies T3
  ON T1.TID = T2.TID
  AND T2.TID = T3.TID
  AND T1.item < T2.item and T2.item < T3.item
GROUP BY T1.item, T2.item, T3.item
HAVING 1.0*COUNT() / (SELECT COUNT(DISTINCT TID) FROM Movies) > :support

 * sqlite://
Done.

[('Big Hero 6', 'Boyhood', 'Gone Girl', 56),
 ('Big Hero 6', 'Boyhood', 'The Imitation Game', 57),
 ('Big Hero 6', 'Fury', 'Gone Girl', 43),
 ('Big Hero 6', 'Fury', 'The Imitation Game', 44),
 ('Big Hero 6', 'Gone Girl', 'Inside Out', 85),
 ('Big Hero 6', 'Gone Girl', 'The Imitation Game', 119),
 ('Big Hero 6', 'Inside Out', 'The Imitation Game', 102),
 ('Boyhood', 'Fury', 'Gone Girl', 43),
 ('Boyhood', 'Fury', 'The Imitation Game', 43),
 ('Boyhood', 'Gone Girl', 'Inside Out', 54),
 ('Boyhood', 'Gone Girl', 'The Imitation Game', 95),
 ('Boyhood', 'Inside Out', 'The Imitation Game', 52),
 ('Fury', 'Gone Girl', 'The Imitation Game', 70),
 ('Gone Girl', 'Inside Out', 'The Imitation Game', 103)]

In [19]:
%%sql
SELECT T1.item AS item1, T2.item AS item2, T3.item AS item3, T4.item AS item4, COUNT()
FROM Movies T1
JOIN Movies T2, Movies T3, Movies T4
  ON T1.TID = T2.TID
  AND T2.TID = T3.TID
  AND T3.TID = T4.TID
  AND T1.item < T2.item
  AND T2.item < T3.item
  AND T3.item < T4.item
GROUP BY T1.item, T2.item, T3.item, T4.item
HAVING 1.0*COUNT() / (SELECT COUNT(DISTINCT TID) FROM Movies) > :support

 * sqlite://
Done.

[('Big Hero 6', 'Boyhood', 'Gone Girl', 'The Imitation Game', 46),
 ('Big Hero 6', 'Gone Girl', 'Inside Out', 'The Imitation Game', 59),
 ('Boyhood', 'Gone Girl', 'Inside Out', 'The Imitation Game', 42)]

## Shopping dataset - association rules

### Association rules with one item on the left-hand side

In [20]:
support = .5
confidence = .5
print(support, confidence)

0.5 0.5

#### First compute frequent item-sets of one item with specified support, as candidate left-hand sides of assocation rules; include number of transactions

In [21]:
%%sql
select item, count() as numtrans
from Shop
group by item
having 1.0*count() / (select count(distinct TID) from Shop) > :support

 * sqlite://
Done.

[('eggs', 3), ('juice', 3), ('milk', 4)]

#### Do the same query but save the result in a table called "Frequents"

In [22]:
%%sql
drop table if exists Frequent;
create table Frequent(item, numtrans);
insert into Frequent
select item, count()
from Shop
group by item
having 1.0*count() / (select count(distinct TID) from Shop) > :support;
select * from Frequent

 * sqlite://
Done.
Done.
3 rows affected.
Done.

[('eggs', 3), ('juice', 3), ('milk', 4)]

#### All pairs with frequent left-hand side, number of transactions for left-hand side, and number of transactions for both

In [23]:
%%sql
select T1.item as LHS, T2.item as RHS, F.numtrans as LHS_count, count() as both
from Shop T1, Shop T2, Frequent F
where T1.item = F.item
and T1.TID = T2.TID
and T1.item != T2.item
group by T1.item, T2.item

 * sqlite://
Done.

[('eggs', 'chips', 3, 1),
 ('eggs', 'juice', 3, 1),
 ('eggs', 'milk', 3, 2),
 ('juice', 'chips', 3, 1),
 ('juice', 'cookies', 3, 2),
 ('juice', 'eggs', 3, 1),
 ('juice', 'milk', 3, 3),
 ('milk', 'chips', 4, 1),
 ('milk', 'cookies', 4, 2),
 ('milk', 'eggs', 4, 2),
 ('milk', 'juice', 4, 3)]

#### Add check for specified confidence to get final result

In [24]:
%%sql
select T1.item as LHS, T2.item as RHS
from Shop T1, Shop T2, Frequent F
where T1.item = F.item
and T1.TID = T2.TID
and T1.item != T2.item
group by T1.item, T2.item
having 1.0*count() / F.numtrans > :confidence

 * sqlite://
Done.

[('eggs', 'milk'), ('juice', 'cookies'), ('juice', 'milk'), ('milk', 'juice')]

### Association rules with two items on the left-hand side

In [25]:
support = .5
confidence = .5
print(support, confidence)

0.5 0.5

#### First compute frequent item-sets of two items with specified support, as candidate left-hand sides of assocation rules. Save in table "Frequent" along with number of transactions

In [26]:
%%sql
drop table if exists Frequent;
create table Frequent(item1, item2, numtrans);
insert into Frequent
select T1.item, T2.item, count()
from Shop T1, Shop T2
where T1.TID = T2.TID
and T1.item < T2.item
group by T1.item, T2.item
having 1.0*count() / (select count(distinct TID) from Shop) > :support;
select * from Frequent

 * sqlite://
Done.
Done.
1 rows affected.
Done.

[('juice', 'milk', 3)]

#### All triples with frequent left-hand side, number of transactions for left-hand side, and number of transactions for all three

In [27]:
%%sql
select T1.item as LHS1, T2.item as LHS2, T3.item as RHS, F.numtrans, count()
from Shop T1, Shop T2, Shop T3, Frequent F
where T1.item = F.item1 and T2.item = F.item2
and T1.TID = T2.TID and T2.TID = T3.TID
and T1.item != T2.item and T2.item != T3.item and T1.item != T3.item
group by T1.item, T2.item, T3.item

 * sqlite://
Done.

[('juice', 'milk', 'chips', 3, 1),
 ('juice', 'milk', 'cookies', 3, 2),
 ('juice', 'milk', 'eggs', 3, 1)]

#### Add check for specified confidence to get final result

In [28]:
%%sql
select T1.item as LHS1, T2.item as LHS2, T3.item as RHS
from Shop T1, Shop T2, Shop T3, Frequent F
where T1.item = F.item1 and T2.item = F.item2
and T1.TID = T2.TID and T2.TID = T3.TID
and T1.item != T2.item and T2.item != T3.item and T1.item != T3.item
group by T1.item, T2.item, T3.item
having 1.0*count() / F.numtrans > :confidence

 * sqlite://
Done.

[('juice', 'milk', 'cookies')]

## Shopping dataset - association rules with lift instead of confidence

#### Compute overall frequency of each item -- needed for lift calculation

In [29]:
%%sql
select item, 1.0*count() / (select count(distinct TID) from Shop)
from Shop
group by item

 * sqlite://
Done.

[('chips', 0.4),
 ('cookies', 0.4),
 ('eggs', 0.6),
 ('juice', 0.6),
 ('milk', 0.8)]

#### Do the same query but save the result in a table called "ItemFreq"

In [30]:
%%sql
drop table if exists ItemFreq;
create table ItemFreq(item, freq);
insert into ItemFreq
select item, 1.0*count() / (select count(distinct TID) from Shop)
from Shop
group by item;
select * from ItemFreq

 * sqlite://
Done.
Done.
5 rows affected.
Done.

[('chips', 0.4),
 ('cookies', 0.4),
 ('eggs', 0.6),
 ('juice', 0.6),
 ('milk', 0.8)]

### Association rules with one item on the left-hand side

In [31]:
support = .5
print(support)

0.5

#### First compute frequent item-sets of one item with specified support, as candidate left-hand sides of assocation rules. Save in table "Frequent" along with number of transactions.

In [32]:
%%sql
drop table if exists Frequent;
create table Frequent(item, numtrans);
insert into Frequent
select item, count()
from Shop
group by item
having 1.0*count() / (select count(distinct TID) from Shop) > :support;
select * from Frequent

 * sqlite://
Done.
Done.
3 rows affected.
Done.

[('eggs', 3), ('juice', 3), ('milk', 4)]

#### All pairs with frequent left-hand side, number of transactions for left-hand side, and number of transactions for both

In [33]:
%%sql
select T1.item as LHS, T2.item as RHS, F.numtrans, count()
from Shop T1, Shop T2, Frequent F
where T1.item = F.item
and T1.TID = T2.TID
and T1.item != T2.item
group by T1.item, T2.item

 * sqlite://
Done.

[('eggs', 'chips', 3, 1),
 ('eggs', 'juice', 3, 1),
 ('eggs', 'milk', 3, 2),
 ('juice', 'chips', 3, 1),
 ('juice', 'cookies', 3, 2),
 ('juice', 'eggs', 3, 1),
 ('juice', 'milk', 3, 3),
 ('milk', 'chips', 4, 1),
 ('milk', 'cookies', 4, 2),
 ('milk', 'eggs', 4, 2),
 ('milk', 'juice', 4, 3)]

#### Add check for lift > 1 to get final result

In [34]:
%%sql
select T1.item as LHS, T2.item as RHS, (1.0*count() / F.numtrans) / I.freq as lift
from Shop T1, Shop T2, Frequent F, ItemFreq I
where T1.item = F.item
and T1.TID = T2.TID
and T2.item = I.item
and T1.item != T2.item
group by T1.item, T2.item
having (1.0*count() / F.numtrans) / I.freq > 1

 * sqlite://
Done.

[('juice', 'cookies', 1.6666666666666665),
 ('juice', 'milk', 1.25),
 ('milk', 'cookies', 1.25),
 ('milk', 'juice', 1.25)]

### Association rules with two items on the left-hand side

In [35]:
support = .5
print(support)

0.5

#### First compute frequent item-sets of two items with specified support, as candidate left-hand sides of assocation rules. Save in table "Frequent" along with number of transactions

In [36]:
%%sql
drop table if exists Frequent;
create table Frequent(item1, item2, numtrans);
insert into Frequent
select T1.item, T2.item, count()
from Shop T1, Shop T2
where T1.TID = T2.TID
and T1.item < T2.item
group by T1.item, T2.item
having 1.0*count() / (select count(distinct TID) from Shop) > :support;
select * from Frequent

 * sqlite://
Done.
Done.
1 rows affected.
Done.

[('juice', 'milk', 3)]

#### All triples with frequent left-hand side, number of transactions for left-hand side, and number of transactions for all three

In [37]:
%%sql
select T1.item as LHS1, T2.item as LHS2, T3.item as RHS, F.numtrans, count()
from Shop T1, Shop T2, Shop T3, Frequent F
where T1.item = F.item1 and T2.item = F.item2
and T1.TID = T2.TID and T2.TID = T3.TID
and T1.item != T2.item and T2.item != T3.item and T1.item != T3.item
group by T1.item, T2.item, T3.item

 * sqlite://
Done.

[('juice', 'milk', 'chips', 3, 1),
 ('juice', 'milk', 'cookies', 3, 2),
 ('juice', 'milk', 'eggs', 3, 1)]

#### Add check for lift > 1 to get final result

In [38]:
%%sql
select T1.item as LHS1, T2.item as LHS2, T3.item as RHS, (1.0*count() / F.numtrans) / I.freq as lift
from Shop T1, Shop T2, Shop T3, Frequent F, ItemFreq I
where T1.item = F.item1 and T2.item = F.item2
and T1.TID = T2.TID and T2.TID = T3.TID and T3.item = I.item
and T1.item != T2.item and T2.item != T3.item and T1.item != T3.item
group by T1.item, T2.item, T3.item
having (1.0*count() / F.numtrans) / I.freq > 1

 * sqlite://
Done.

[('juice', 'milk', 'cookies', 1.6666666666666665)]

### <font color = 'green'>**Your Turn - Movies dataset association rules**</font>

#### Mine for association rules in the Movies dataset with three items on the left-hand side. Find support and confidence thresholds (need not be the same) so the number of association rules is more than 10 but less than 20.

In [39]:
support = 0.03
confidence = 0.6767
print(support, confidence)

0.03 0.6767

In [40]:
%%sql
drop table if exists Frequent;
CREATE TABLE FREQUENT(item1, item2, item3, numtrans);
INSERT INTO Frequent
SELECT T1.item, T2.item, T3.item, COUNT()
FROM Movies T1
JOIN Movies T2, Movies T3
  ON T1.TID = T2.TID
  AND T2.TID = T3.TID
  AND T1.item < T2.item
  AND T2.item < T3.item
GROUP BY T1.item, T2.item, T3.item
HAVING 1.0*COUNT() / (SELECT COUNT(DISTINCT TID) FROM Movies) > :support;
SELECT * FROM Frequent

 * sqlite://
Done.
Done.
14 rows affected.
Done.

[('Big Hero 6', 'Boyhood', 'Gone Girl', 56),
 ('Big Hero 6', 'Boyhood', 'The Imitation Game', 57),
 ('Big Hero 6', 'Fury', 'Gone Girl', 43),
 ('Big Hero 6', 'Fury', 'The Imitation Game', 44),
 ('Big Hero 6', 'Gone Girl', 'Inside Out', 85),
 ('Big Hero 6', 'Gone Girl', 'The Imitation Game', 119),
 ('Big Hero 6', 'Inside Out', 'The Imitation Game', 102),
 ('Boyhood', 'Fury', 'Gone Girl', 43),
 ('Boyhood', 'Fury', 'The Imitation Game', 43),
 ('Boyhood', 'Gone Girl', 'Inside Out', 54),
 ('Boyhood', 'Gone Girl', 'The Imitation Game', 95),
 ('Boyhood', 'Inside Out', 'The Imitation Game', 52),
 ('Fury', 'Gone Girl', 'The Imitation Game', 70),
 ('Gone Girl', 'Inside Out', 'The Imitation Game', 103)]

In [41]:
%%sql
SELECT T1.item AS LHS1, T2.item AS LHS2, T3.item AS LHS3, T4.item AS RHS, F.numtrans, COUNT()
FROM Movies T1
JOIN Movies T2, Movies T3, Movies T4, Frequent F
  ON T1.item = F.item1
  AND T2.item = F.item2
  AND T3.item = F.item3
  AND T1.TID = T2.TID
  AND T2.TID = T3.TID
  AND T3.TID = T4.TID
  AND T1.item != T2.item
  AND T2.item != T3.item
  AND T3.item != T4.item
  AND T1.item != T3.item
  AND T1.item != T4.item
  AND T2.item != T4.item
GROUP BY T1.item, T2.item, T3.item, T4.item
HAVING 1.0*COUNT() / F.numtrans > :confidence

 * sqlite://
Done.

[('Big Hero 6', 'Boyhood', 'Gone Girl', 'The Imitation Game', 56, 46),
 ('Big Hero 6', 'Boyhood', 'The Imitation Game', 'Gone Girl', 57, 46),
 ('Big Hero 6', 'Fury', 'Gone Girl', 'The Imitation Game', 43, 36),
 ('Big Hero 6', 'Fury', 'The Imitation Game', 'Gone Girl', 44, 36),
 ('Big Hero 6', 'Gone Girl', 'Inside Out', 'The Imitation Game', 85, 59),
 ('Boyhood', 'Fury', 'Gone Girl', 'The Imitation Game', 43, 39),
 ('Boyhood', 'Fury', 'The Imitation Game', 'Gone Girl', 43, 39),
 ('Boyhood', 'Gone Girl', 'Inside Out', 'The Imitation Game', 54, 42),
 ('Boyhood', 'Inside Out', 'The Imitation Game', 'Gone Girl', 52, 42)]

#### Mine for association rules in the Movies dataset with three items on the left-hand side. Find support and lift thresholds so the number of association rules is more than 10 but less than 20.

In [51]:
support = 0.025
lift = 36
print(support)
print(lift)

0.025
36

In [52]:
%%sql
drop table if exists ItemFreq;
CREATE TABLE ItemFreq(item, freq);
INSERT INTO ItemFreq
SELECT item, 1.0*COUNT() / (SELECT COUNT(DISTINCT TID) FROM Movies)
FROM Movies
GROUP BY item;
SELECT * FROM ItemFreq

 * sqlite://
Done.
Done.
123 rows affected.
Done.

[('400 Days', 0.002170767004341534),
 ('A Walk in the Woods', 0.000723589001447178),
 ('About Alex', 0.005065123010130246),
 ('Action Jackson', 0.000723589001447178),
 ('American Ultra', 0.013024602026049204),
 ('Annie', 0.004341534008683068),
 ('Anti-Social', 0.000723589001447178),
 ('Appropriate Behaviour', 0.001447178002894356),
 ('Ascension', 0.002170767004341534),
 ('Aziz Ansari: Live at Madison Square Garden', 0.000723589001447178),
 ('Bad Asses on the Bayou', 0.000723589001447178),
 ('Bad Country', 0.000723589001447178),
 ('Batkid Begins', 0.000723589001447178),
 ('Bears', 0.000723589001447178),
 ('Beautiful Girl', 0.000723589001447178),
 ('Before I Disappear', 0.005065123010130246),
 ('Best of Enemies', 0.002170767004341534),
 ('Big Eyes', 0.020984081041968163),
 ('Big Hero 6', 0.28002894356005786),
 ('Blind', 0.000723589001447178),
 ('Boyhood', 0.1649782923299566),
 ('Break Point', 0.000723589001447178),
 ('Breathe', 0.000723589001447178),
 ('Butterfly', 0.000723589001447178),
 ('Calvary', 0.02604920405209841),
 ('Camp Belvidere', 0.000723589001447178),
 ('Carmina and Amen (Carmina y am̩n)', 0.000723589001447178),
 ('Catch Hell', 0.000723589001447178),
 ('Contracted: Phase II', 0.000723589001447178),
 ('Copenhagen', 0.005065123010130246),
 ('Court', 0.000723589001447178),
 ('Crimes Against Humanity', 0.001447178002894356),
 ('Cruel & Unusual', 0.001447178002894356),
 ('Daawat-e-Ishq', 0.000723589001447178),
 ('Dark Summer', 0.000723589001447178),
 ('Deadly Virtues: Love.Honour.Obey.', 0.000723589001447178),
 ('Dear White People', 0.006512301013024602),
 ('Demonic', 0.001447178002894356),
 ('Dum Laga Ke Haisha', 0.002170767004341534),
 ('Eat', 0.000723589001447178),
 ('Effie Gray', 0.000723589001447178),
 ('Entertainment', 0.000723589001447178),
 ('Exists', 0.000723589001447178),
 ('Exposed', 0.000723589001447178),
 ('Faith of Our Fathers', 0.001447178002894356),
 ('Far from Men', 0.000723589001447178),
 ('Final Girl', 0.000723589001447178),
 ('Flowers in the Attic', 0.000723589001447178),
 ('Force Majeure (Turist)', 0.01085383502170767),
 ('Fury', 0.09985528219971057),
 ('Gangster Payday', 0.000723589001447178),
 ('Gett: The Trial of Viviane Amsalem', 0.002894356005788712),
 ('Gone Girl', 0.42185238784370477),
 ('Grace', 0.002170767004341534),
 ('Grandma', 0.000723589001447178),
 ("I'll See You in My Dreams", 0.000723589001447178),
 ('In No Great Hurry: 13 Lessons in Life with Saul Leiter', 0.000723589001447178),
 ('In Order of Disappearance (Kraftidioten)', 0.001447178002894356),
 ('In the Heart of the Sea', 0.006512301013024602),
 ('Inside Out', 0.3256150506512301),
 ('Jim Gaffigan: Obsessed', 0.002170767004341534),
 ('Justice League: Gods and Monsters', 0.00361794500723589),
 ('Laggies', 0.012301013024602027),
 ('Leviathan', 0.016642547033285094),
 ('Listen Up Philip', 0.002894356005788712),
 ('Louis C.K.: Live at The Comedy Store', 0.06512301013024602),
 ('Love Me', 0.000723589001447178),
 ('Magic Mike XXL', 0.005788712011577424),
 ('Magic in the Moonlight', 0.01808972503617945),
 ('Man Up', 0.005065123010130246),
 ('Merchants of Doubt', 0.001447178002894356),
 ('Mr. Peabody & Sherman', 0.006512301013024602),
 ('National Gallery', 0.000723589001447178),
 ('No No: A Dockumentary', 0.001447178002894356),
 ('Outcast', 0.000723589001447178),
 ("PAY 2 PLAY: Democracy's High Stakes", 0.000723589001447178),
 ('Preggoland', 0.000723589001447178),
 ('Rage', 0.001447178002894356),
 ('Raised by Wolves', 0.000723589001447178),
 ('Samba', 0.002894356005788712),
 ('Scusate se esisto!', 0.000723589001447178),
 ('Self/less', 0.01085383502170767),
 ("She's Funny That Way", 0.00361794500723589),
 ('Sinister 2', 0.000723589001447178),
 ('Sisters', 0.00723589001447178),
 ('Skin Trade', 0.000723589001447178),
 ('Stage Fright', 0.001447178002894356),
 ('Steve Jobs: The Man in the Machine', 0.005065123010130246),
 ('Strangerland', 0.002170767004341534),
 ('Tanu Weds Manu Returns', 0.000723589001447178),
 ('Teenage Mutant Ninja Turtles', 0.028219971056439943),
 ('The Best of Me', 0.00361794500723589),
 ('The Big Short', 0.023878437047756874),
 ('The Christmas Secret', 0.000723589001447178),
 ("The Crow's Nest", 0.000723589001447178),
 ('The Divine Move', 0.001447178002894356),
 ('The Fault in Our Stars', 0.08031837916063676),
 ('The Green Prince', 0.000723589001447178),
 ('The Humbling', 0.001447178002894356),
 ('The Hunger Games: Mockingjay - Part 2', 0.04703328509406657),
 ('The Imitation Game', 0.48986975397973953),
 ('The Little Death', 0.006512301013024602),
 ('The Little Rascals Save the Day', 0.000723589001447178),
 ('The Mend', 0.000723589001447178),
 ('The Price of Gold', 0.001447178002894356),
 ('The Treasure', 0.000723589001447178),
 ('The Unexpected Love', 0.000723589001447178),
 ('The Vatican Tapes', 0.000723589001447178),
 ('The Voices', 0.015195369030390739),
 ('The Wonders', 0.000723589001447178),
 ('Time Out of Mind', 0.000723589001447178),
 ('Transformers: Age of Extinction', 0.049927641099855286),
 ('Turks & Caicos', 0.001447178002894356),
 ('Unexpected', 0.001447178002894356),
 ('V/H/S: Viral', 0.002894356005788712),
 ('Victor Frankenstein', 0.002170767004341534),
 ('Viy', 0.000723589001447178),
 ('Wanderers', 0.002170767004341534),
 ('Web Junkie', 0.000723589001447178),
 ('Welcome to Leith', 0.001447178002894356),
 ('Whitey: United States of America v. James J. Bulger', 0.000723589001447178),
 ('Wild Card', 0.00361794500723589),
 ('Wild Tales', 0.049204052098408106)]

In [53]:
%%sql
drop table if exists Frequent;
CREATE TABLE Frequent(item1, item2, item3, numtrans);
INSERT INTO Frequent
SELECT T1.item, T2.item, T3.item, COUNT()
FROM Movies T1
JOIN Movies T2, Movies T3
  ON T1.TID = T2.TID
  AND T2.TID = T3.TID
  AND T1.item < T2.item
  AND T2.item < T3.item
GROUP BY T1.item, T2.item, T3.item
HAVING 1.0*COUNT() / (SELECT COUNT(DISTINCT TID) FROM Movies) > :support;
SELECT * FROM Frequent

 * sqlite://
Done.
Done.
19 rows affected.
Done.

[('Big Hero 6', 'Boyhood', 'Gone Girl', 56),
 ('Big Hero 6', 'Boyhood', 'Inside Out', 39),
 ('Big Hero 6', 'Boyhood', 'The Imitation Game', 57),
 ('Big Hero 6', 'Fury', 'Gone Girl', 43),
 ('Big Hero 6', 'Fury', 'The Imitation Game', 44),
 ('Big Hero 6', 'Gone Girl', 'Inside Out', 85),
 ('Big Hero 6', 'Gone Girl', 'The Imitation Game', 119),
 ('Big Hero 6', 'Inside Out', 'The Imitation Game', 102),
 ('Boyhood', 'Fury', 'Gone Girl', 43),
 ('Boyhood', 'Fury', 'The Imitation Game', 43),
 ('Boyhood', 'Gone Girl', 'Inside Out', 54),
 ('Boyhood', 'Gone Girl', 'The Imitation Game', 95),
 ('Boyhood', 'Inside Out', 'The Imitation Game', 52),
 ('Fury', 'Gone Girl', 'Inside Out', 40),
 ('Fury', 'Gone Girl', 'The Imitation Game', 70),
 ('Fury', 'Inside Out', 'The Imitation Game', 39),
 ('Gone Girl', 'Inside Out', 'The Imitation Game', 103),
 ('Gone Girl', 'The Fault in Our Stars', 'The Imitation Game', 35),
 ('Gone Girl', 'The Imitation Game', 'Wild Tales', 35)]

In [54]:
%%sql
SELECT T1.item AS LHS1, T2.item AS LHS2, T3.item AS LHS3, T4.item AS RHS,
       (1.0*COUNT() / F.numtrans) / I.freq AS lift
FROM Movies T1
JOIN Movies T2, Movies T3, Movies T4, Frequent F, ItemFreq I
  ON T1.item = F.item1
  and T2.item = F.item2
  AND T3.item = F.item3
  AND T1.TID = T2.TID
  AND T2.TID = T3.TID
  AND T3.TID = T4.TID
  AND T4.item = I.item
  AND T1.item != T2.item
  AND T2.item != T3.item
  AND T3.item != T4.item
  AND T1.item != T3.item
  AND T1.item != T4.item
  AND T2.item != T4.item
GROUP BY T1.item, T2.item, T3.item, T4.item
HAVING (1.0*COUNT() / F.numtrans) / I.freq > :lift

 * sqlite://
Done.

[('Gone Girl', 'The Fault in Our Stars', 'The Imitation Game', 'Action Jackson', 39.48571428571429),
 ('Gone Girl', 'The Fault in Our Stars', 'The Imitation Game', 'Breathe', 39.48571428571429),
 ('Gone Girl', 'The Fault in Our Stars', 'The Imitation Game', 'Catch Hell', 39.48571428571429),
 ('Gone Girl', 'The Fault in Our Stars', 'The Imitation Game', 'Court', 39.48571428571429),
 ('Gone Girl', 'The Fault in Our Stars', 'The Imitation Game', "I'll See You in My Dreams", 39.48571428571429),
 ('Gone Girl', 'The Fault in Our Stars', 'The Imitation Game', 'Outcast', 39.48571428571429),
 ('Gone Girl', 'The Fault in Our Stars', 'The Imitation Game', 'Time Out of Mind', 39.48571428571429),
 ('Gone Girl', 'The Imitation Game', 'Wild Tales', 'Entertainment', 39.48571428571429),
 ('Gone Girl', 'The Imitation Game', 'Wild Tales', 'Far from Men', 39.48571428571429),
 ('Gone Girl', 'The Imitation Game', 'Wild Tales', "I'll See You in My Dreams", 39.48571428571429),
 ('Gone Girl', 'The Imitation Game', 'Wild Tales', 'Outcast', 39.48571428571429),
 ('Gone Girl', 'The Imitation Game', 'Wild Tales', 'The Wonders', 39.48571428571429),
 ('Gone Girl', 'The Imitation Game', 'Wild Tales', 'Time Out of Mind', 39.48571428571429)]